// Створіть змінну str і дайте їй значення 'abcde'. Звертаючись до окремих символів цього рядка,
//виведіть на екран символ 'a', символ 'b', символ 'e'.
// const str = 'abcde';
// console.log(str[0]);
// console.log(str[1]);
// console.log(str[str.length -1]);

// Переробіть наведений код так, щоб у ньому використовувалися операції +=, -=, *=, /=, ++, --.
//Кількість рядків коду не повинна змінитися. Код для переробки:
// let num = 1;
// num = num + 12;
// num = num - 14;
// num = num * 5;
// num = num / 7;
// num = num + 1;
// num = num - 1;

// let num = 1;
// console.log(num += 12);
// console.log(num -= 14);
// console.log(num *= 5);
// console.log(num /= 7);
// console.log(++num);
// console.log(--num);


/* Склади фразу за допомогою шаблонних рядків A has B bots in stock, де A, B - змінні вставлені в рядок.
 */
// const companyName = 'Cyberdyne Systems';
// const repairBots = 150;
// const defenseBots = 50;

// console.log(`${companyName} has ${repairBots}` );


// Напишіть інструкцию, яка приймає рядок як аргумент і перетворює регістр першого
// символу рядка з нижнього регістру у верхній.
// const str = "string not starting with capital";
// console.log(str[0].toUpperCase() + str.slice(1));


// Ви просите користувача ввести суму його зарплати. Потім розраховуєте:
// Добавку у вигляді премії у сумі 15% від зарплати.
// Податки у сумі 10% від суми всіх нарахувань (зарплата + премія).
// Витрату в магазині в сумі 190.
// Розділяєте суму, що залишилася, між користувачем і його "дружиною"/"чоловіком".
// const sum = Number(prompt('Введить суму зарплати'));
// const gift = +prompt('Ваша зарплата із премією - $', sum + (sum * 0.15));
// const tax = +prompt('Податок на дохід - $', gift * 0.1);
// const purchases = +prompt('Витрати в магазині - $', 190)
// const result = +prompt('Ви, та ваша дружина, отримуєте по $', (gift - tax - purchases) / 2);

// console.log(`Ви, та ваша дружина, отримуєте по $${result}`);


// Потрібно попросити користувача задумати число. Потім він повинен помножити це
//число на 2 і додати отриманого результату 7.
// Те, що сталося в результаті, потрібно ввести в діалоговому вікні prompt().
// Ви повинні видати користувачеві, скільки він задумав.
// alert('Загадайте число');
// alert('Помножте ваше число на 2, та додайте до отриманого результату 7');
// const resultNumber = +prompt('Введить число, яке вийшло');
// const userNumber = +prompt('Число, яке ви загадали - ', (resultNumber - 7) / 2);
// console.log(userNumber);

